{
  "clr-accordion": "An accordion is a collection of vertically stacked sections with multiple content areas which may be expanded or minimized by the user to reveal their content.",
  "clr-alert": "Alerts are banners that draw the user's attention to an important message. Elements of an alert, such as icons and color, indicate the type and urgency of the message's information.",
  "cds-alert": "Alerts are banners that draw the user's attention to an important message. Elements of an alert, such as icons and color, indicate the type and urgency of the message's information.",
  "clr-badge": "Badges are status modifiers to other elements which display the numerical value within an element either next to it or inside the element itself.",
  "cds-badge": "Badges are status modifiers to other elements which display the numerical value within an element either next to it or inside the element itself.",
  "clr-button": "Buttons allow an application to communicate action and direct user intent.",
  "cds-button": "Buttons allow an application to communicate action and direct user intent.",
  "clr-button-group": "Button groups are for creating collections of similar type action buttons.",
  "clr-card": "Cards are used to apply a container around a related grouping of information.",
  "clr-checkbox": "With checkboxes, users can select one or more options from a list of options.",
  "cds-checkbox": "A checkbox is a form element comprising a series of items that make a list of options that allow the user to select any number of choices. Those choices can range from zero, one or several. The selections are not mutually exclusive.",
  "clr-combobox": "A combobox is a complex element, which can be considered as a combination of two elements - a dropdown list and a text input. The text input is used for quick search and filtering of the predefined options from the dropdown list.",
  "cds-control": "The Control component provides a way to leverage the same Clarity Form layout(s) and behaviors and integrate a custom or third party input control.",
  "clr-datagrid": "A datagrid is a presentation of data in a table which enables the user to perform actions upon the entries which are organized in rows, with columns for each attribute.",
  "clr-datalist": "The datalist element offers a flexible input when users need to filter and select from a large list of pre-defined options. Or, they need to input a custom value (not provided in the pre-defined list) for the input.",
  "cds-datalist": "Datalist is a type of list that becomes contextualized through the selection of extensive pre-defined options. Datalists can contain a custom input value.",
  "clr-date": "Date Picker is a popover control for picking a date value for a date input. It's also sometimes referred to as Datepicker.",
  "clr-dropdown": "A dropdown menu is a contextual list that allows the user to choose an option that take an immediate action or navigate the user to another view. The source of the dropdown is usually a button.",
  "clr-form": "Forms are a grouping of input controls that allow a user to submit information to your application.",
  "cds-form": "Forms are input controls and groups of input controls manage the collection and submission of data from your user to the application.",
  "cds-form-group": "Form groups provides a way to organize forms and make them more understandable for users. Users can focus on smaller groups instead of the whole form all at once.",
  "clr-grid": "A grid provides a structure of rows and columns for aligning content. Grids are useful because they help create a familiar and easily navigable structure for content.",
  "clr-header": "Headers provide branding, navigation, search, and access to global application actions such as settings and notifications.",
  "cds-icon-button": "Icon buttons are useful where interface space may be limited. If an icon represents the action well, users can sometimes recognize them quicker than reading text. Using icon buttons can also help when space constraints prevent the use of long labels.",
  "cds-inline-button": "Inline buttons are used inside and alongside textual content within Clarity components. Inline buttons give action buttons a less prominent, yet familiar, visual presence. Use them with caution, however, because they can be easily confused with links.",
  "clr-input": "Inputs enable the user to input text information.",
  "cds-input": "Inputs enable the user to input text information.",
  "cds-input-group": "An input-group combines closely related input controls into a single visual control.",
  "cds-input-prefix-suffix": "An input-group combines closely related input controls into a single visual control.",
  "clr-label": "Labels show concise metadata in a compact format.",
  "clr-list": "Lists are for showing a set of items in sequence, and can be nested to show some hierarchy.",
  "cds-list": "Lists are for showing a set of items in sequence and can be nested to show hierarchy.",
  "clr-login": "A predefined form for applications that require authentication as part of the login experience.",
  "clr-modal": "Modals are dialogues which provide information or help a user complete a task. They require the user to take an action to dismiss them.",
  "cds-modal": "Modals inform users about a task and can contain decisive information that requires immediate attention.",
  "clr-password": "Password fields are a specialized input field with the ability to toggle between the masked field or to view the password in plain text.",
  "cds-password": "The password field is a specialized input field with the ability to toggle between the masked field or to view the password in plain text.",
  "clr-progress-bar": "A progress bar is a linear indicator for providing feedback about an ongoing, user-initiated process.",
  "clr-radio": "Using radio buttons, users can select one option from a group of options.",
  "cds-radio": "The radio button is a form element comprising a series of items that make a list of options that allow the user to select options that are mutually exclusive of each other. Users may only select a single radio button within a series of items that make a list.",
  "clr-range": "The HTML5 range input element is used when a user can choose between a min and a max value but the precise value chosen is not considered important.",
  "cds-range": "The range input component consists of a slider enabling a choice between a minimum and a maximum value. It allows the user to select a value when the precise value chosen is not considered necessary.",
  "clr-select": "With a select box, users can select one item from a list of values. The selected item is visible when the select box is closed.",
  "cds-select": "A select box is a form element that surfaces a drop down list with a set of choices and displays the users selection when complete.",
  "clr-sidenav": "The sidenav is a left-aligned navigational component.",
  "clr-signpost": "The signpost is a convenient, lightweight way to show contextual help of information without taking the user out of the current context.",
  "clr-spinner": "A spinner is visual indicator of an ongoing, user-initiated process.",
  "clr-stack-view": "A stack view displays key/value pairs, which users can expand to show more detail.",
  "clr-stepper": "A stepper structures multi-step processes into 2 or more expanding panels that break up complex workflows.",
  "clr-tabs": "Tabs divide content into separate views which users navigate between.",
  "clr-table": "A table displays information in a grid of rows and columns providing a method of organizing information in way that facilitates comparisons to discover patterns and insights.",
  "cds-tag": "Tags show concise metadata in a compact format.",
  "clr-textarea": "Textareas are a popular form control for long form text input, and Clarity supports both a CSS only and Angular component. You may wish to review the general forms documentation about form controls.",
  "cds-textarea": "The textareas provide a form control for long form text input. When anticipating user inputs of a sentence or less, use an input. Multiple usages of an input strung together may constitute a form. See forms for more details.",
  "clr-timeline": "A timeline displays a series of events which can guide the user through processes or pre-defined steps while also showing current progress.",
  "clr-toggle": "Toggle switches allow the selection of on or off state.",
  "cds-toggle": "Toggle switches are the digital equivalent of a physical on/off switch. They ask the user to choose between two and mutually exclusive options while always having a default value.",
  "clr-tooltip": "A tooltip is a momentary dialogue which surfaces from an info icon and provides additional information pertaining to the corresponding UI element.",
  "clr-tree": "A tree is a hierarchical component that gives users access to a hierarchical set of objects displayed in a the parent-child relationship.",
  "clr-vertical-nav": "A vertically-aligned list of the destinations in an application.",
  "clr-wizard": "A wizard provides an interface for a user to proceed through a sequence of steps required to complete a task."
}
